{
"moduleCode": "AR5467",
"moduleTitle": "Domesticity in Architecture, Art & Film",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "For Years 4, 5 and postgraduate students only. This is a humanities-based module with high visual and textual components.",
"prerequisite": "Students in their senior years of study (4th years and above), or those conducting postgraduate research on a related topic, should only apply. This module is open to cross-faculty applicants. Students from Architecture, Geography, Literature, English, dia, Cultural Studies, for example, will find this module applicable. Potential students should be interested in visual culture and architecture, and are keen on reading, watching films and understanding contemporary art. The seminars require students to contribute to reading response assignments. Students should come to class having read the assigned readings/ watch the films/ be familiar with the exhibitions listed.",
"preclusionList": [],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "AR5467", 
            "children": []
},
"moduleDescription": "Despite Modern Architecture’s emphasis on housing, the domestic realm (its interiority, experience and occupancy) is often a neglected area of study since attention is focused on housing as a large-scale urban form. Yet, domestic spaces embed important issues of gender, class, taste, ethnicity, family filial ties ('filiality') and identity. This interdisciplinary module explores the concept of domesticity – how and where we live – by examining its portrayals in architecture, art and film. It gives a broad and critical overview by working through a series of key contemporary architectural, art and film projects drawn from Asia, Europe and the United States.",
"crossModule": "-1",
"corequisite": "NIL",
"faculty": "SCHOOL OF DESIGN AND ENVIRONMENT",
"department": "ARCHITECTURE",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,0,2,0,0,]]
}
