{
"moduleCode": "AR5952N",
"moduleTitle": "Topics In Urban Studies - Shaping Liveable Places",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "NIL",
"prerequisite" : "NIL",
"preclusionList": [],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "AR5952N", 
            "children": []
},
"moduleDescription": "This course on “SHAPING BLUE/GREEN/SOCIAL FOR LIVEABLE PLACES - Case study on Pulau Ubin, Part I” is imbedded and focusing on a research project on multifunctional liveable places in urban areas. With the megatrends of density and increasing urbanisation, the Blue/Green Places are affected dramatically and are losing space and quality. The loss of biodiversity and the impact of climate change not only have direct impact on the quality of life in cities across the world, recreational activities and mental health are advsersely affected as well. There is an ever-increasing need for new and innovative solutions to combine blue, green and social functions on dense spaces. It will focus on the improvement of greenery and urban water infrastructure and all its benefits on urban liveability. In particular, this study will focus on Pulau Ubin, one of the less developed islands in Singapore. With Singapore’s special anniversary by 2015, this area is significant in terms of recreation and heritage for the broader Singapore region. Therefore, the environmental, social, cultural and economic benefits of a holistic approach will be the topics of this module. The aim is to identify best practices and lessons learned and develop a framework, which can give ideas to city decision makers in general and planners as well as developers and stakeholders in particular. To back up this study, we will explore the current situation through field studies, interviews and analysis of different proposals. Based on this, students will formulate proposals. The module aims to raise the students’ knowledge in strategic thinking on programming, urban landscapes as well in designing and constructing open spaces, greenery and water related projects for their professional practice. According to the multidisciplinary character, it will focus on good governance, participation as well as the practice of Art, Engineering and Architecture. Live hands-on experiments and work with relevant examples in a wide range of situations within the professional practice will be crucial.",
"crossModule": "-1",
"corequisite": "-1",
"faculty": "SCHOOL OF DESIGN AND ENVIRONMENT",
"department": "ARCHITECTURE",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,1,2,0,0,]]
}
