{
"moduleCode": "CM3311",
"moduleTitle": "Undergraduate Professional Internship",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "Applied Science degree of which Professional Placement is already within the curriculum; any other XX3311 or XX3312 modules offered in Science, where XX stands for the subject prefix for the respective major.",
"prerequisite": "SP1001 Career Planning & Preparation or NCC1001 Headstart Module (A Career Development Programme) or NCC1000 Stepup Module (A Career Development Programme) or CFG1001 Headstart Module or CFG1000 StepUp Module; students must have completed 3 regular semesters of study, have declared Chemistry as first major and have completed a minimum of 32 MCs in Chemistry major at time of application.",
"preclusionList": [
            "ST3312",
            "QF3311",
            "LSM3311",
            "CM3312",
            "QF3312",
            "PR3312",
            "ZB3311",
            "ST3311",
            "MA3311",
            "PC3311",
            "PC3312",
            "MA3312"
        ],
"parsedPrerequisite": {
            " or ": [
                "SP1001", 
                "NCC1001", 
                "NCC1000", 
                "CFG1001", 
                "CFG1000"
            ]
},
"prerequisiteList": ["SP1001","NCC1001","NCC1000","CFG1001","CFG1000"],
"completePrerequisite": {
            "name": "CM3311", 
            "children": [
                {
                    "name": "or", 
                    "children": [
                        {
                            "name": "SP1001", 
                            "children": []
                        }, 
                        {
                            "name": "NCC1001", 
                            "children": []
                        }, 
                        {
                            "name": "NCC1000", 
                            "children": []
                        }, 
                        {
                            "name": "CFG1001", 
                            "children": []
                        }, 
                        {
                            "name": "CFG1000", 
                            "children": []
                        }
                    ]
                }
            ]
},
"moduleDescription": "In addition to having a good academic record and technical foundation, students with good soft skills and some industrial attachment or internship experiences often stand a better chance when seeking for jobs. This module gives non-Applied Science students the opportunity to embark on internships during their undergraduate study. The module requires students to compete for position and perform a structured internship in a company/institution for 10-12 weeks during Special Term. Through regular meetings with the Academic Advisor and internship Supervisor, students explore how knowledge learnt in the curriculum can be transferred to perform technical assignments in an actual working environment.",
"crossModule": "-1",
"corequisite": "Nil",
"faculty": "SCIENCE",
"department": "CHEMISTRY",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,1,2,3,4,]]
}
