{
"moduleCode": "DSC4215",
"moduleTitle": "Supply Chain Visualization & Actionable Intelligence",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "NIL",
"prerequisite": "DSC2006 Operations Management",
"preclusionList": [],
"parsedPrerequisite": {
" and ": ["DSC2006"]
},
"prerequisiteList": ["DSC2006"],
"completePrerequisite": {
            "name": "DSC4215", 
            "children": [
                {
                    "name": "DSC2006", 
                    "children": []
                }
            ]
},
"moduleDescription": "Successful supply chain analytics projects require: A business problem, validated data, visualization for initial insights, and statistical analysis for predictive insights. Students will glean insights from real world data, answer strategic business questions, create an Information Strategy for Supply Chain, Visualize and monetize Big Data. Real data sets from supply chain, retail, and social media will be placed in cloud technology like Google or Amazon. The students will use state-of-the-art tools to create amazing visualizations including SAP Lumira, Qlikview,Tableau, SVG, NetNode, and others. Practically, students will also learn about types of data available in a typical corporation, how this data maybe collected, shortcomings, bureaucratic / company's cultural issues. In this era of entrepreneurship we will also look at how startups/NGOs can visualize supply chain opportunities to attract and serve customers. To round out the course we will review the ethical and legal considerations of acquiring and using certain types of data. At the end they will develop the next generation of business analytics using cross-industry data mashups. The skills learned will be usable in other industries and the core concepts are technology agnostic.",
"crossModule": "-1",
"corequisite": "-1",
"faculty": "SCHOOL OF BUSINESS",
"department": "DECISION SCIENCES",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,0,2,0,0,]]
}
