{
"moduleCode": "GE4219",
"moduleTitle": "Development and Environment in Southeast Asia",
"moduleCredit": "5",
"lockedModules":[
],
"preclusion": "SE4211",
"prerequisite": "Cohort 2011 and before: Completed 80 MCs, including 28 MCs in GE, or 28 MCs in MS, or 28 MCs in SE, with a minimum CAP of 3.50 or be on the Honours track. Cohort 2012 onwards: ompleted 80 MCs, including 28 MCs in GE, or 28 MCs in MS, or 28 MCs in SE with a minimum CAP of 3.20 or be on the Honours track. Cohort 2012 onwards: (BES students from both specialisations) Completed 80 MCs of NUS modules before they can read any level-4000 GE modules. Do not need to complete 28 MCs of GE modules before they can read any level-4000 GE modules. Do not need a minimum CAP of 3.20 before they can read any level-4000 GE modules. Cohort 2012 onwards: (Global Studies) Must have read and passed GE1101E and at least one of the following modules: GE2221 and GE3210. Completed at least 80MCs, including 28 MCs in GL/GL recognised non-language modules, with a minimum CAP of 3.20 or be on the Honours track.",
"preclusionList": [
            "SE4211"
        ],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "GE4219", 
            "children": []
},
"moduleDescription": "This module focuses on the intersection between development and environment in Southeast Asia. Utilising a range of conceptual lenses from sustainable development to political ecology, the module interrogates the varied environmental impacts and ramifications of the development of the region. The module pays particular attention to the ways in which environmental change affects everyday lives. Case studies include issues such as upland living and forest peoples, trans-boundary environmental issues, and the role and place of Buddhism as an eco-centric religion. The module encourages a critical view of the trade-offs between economic growth (development) and environmental protection.",
"crossModule": "-1",
"corequisite": "-1",
"faculty": "ARTS & SOCIAL SCIENCES",
"department": "GEOGRAPHY",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,1,0,0,0,]]
}
