{
"moduleCode": "UTC2112",
"moduleTitle": "Animals and the City",
"moduleCredit": "4",
"lockedModules":[
],
"preclusion": "NIL",
"prerequisite": "This four-week intensive module is intended only to be offered in the summer term. Enrollment will be offered to a select group of students, half of them from our IARU and Tembusu College partner residential colleges/university, and the others from NUS. NUS students may take this module as an unrestricted elective. Tembusu College students may take this module to count towards the University Town College Programme (as a Senior Seminar). NUS undergraduates, including Tembusu students, should have a minimum CAP of 3.0 on a 5-point scale. Non-NUS students will be assessed based on recruitment criteria and procedures administered by each participating residential college/university in consultation with NUS Tembusu College. Non-NUS students will have to apply to their home institutions for credit. Ideally, students in this class will be in their second or third year of a four-year undergraduate program, but in general we will accept undergraduates at any level.",
"preclusionList": [],
"parsedPrerequisite" : "nil",
"prerequisiteList": [],
"completePrerequisite": {
            "name": "UTC2112", 
            "children": []
},
"moduleDescription": "With a focus on Asia, this course draws on a diverse range of literatures (history, anthropology, psychology, animal activism) to provide a broad context for understanding the dynamics and conflicts between humans and animals. Southeast Asia is one of last regions in the world with extensive rain forest habitat for wild animals, but these creatures are threatened by burgeoning urbanization and agriculture. We will go beyond a focus on wildlife conservation, however, to also look at ‘urban animals’ such as pets and farm animals, and other topics which are central to life in this part of the world, and others.",
"crossModule": "-1",
"corequisite": "-1",
"faculty": "NON-FACULTY-BASED DEPARTMENTS",
"department": "TEMBUSU COLLEGE",
"history": [[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[0,0,0,0,0,],[2015,0,0,0,4,]]
}
